"""
<문제 링크>
https://www.acmicpc.net/problem/1436
<풀이 링크>
https://wikidocs.net/206249
"""
print(" ■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■")
print(" -=-= P R O G R A M _ S T A R T =-=-")
print("▼▽ ▼▽ ▼▽ ▼▽ ▼▽ ▼▽ ▼▽ ▼▽ ▼▽ ▼▽ ▼▽ ▼▽")
######################################################


n = int(input())
num = 666
ans = num
while n - 1: 

    num += 1
    if '666' in str(num):
        ans = num
        n -= 1
        

print(num) 

# n을 계속 써도 좋다. 갱신이 되나봐
# for 처럼 순서대로 카운트 하는 거 말고 
# 내가 직접 만들 수도 있음.

#######################################################
print(" △ ▲ △ ▲ △ ▲ △ ▲ △ ▲ △ ▲ △ ▲ △ ▲ △ ▲")
print(" -=-=   P R O G R A M _ E N D   =-=-")
print(" ■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■")